tap "felixkratz/formulae"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "teamookla/speedtest"
tap "tophat/bar"
# Automate deployment, configuration, and upgrading
brew "ansible", link: false
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Image format providing lossless and lossy compression for web images
brew "webp"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2", link: false
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Software library to render fonts
brew "freetype"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Tool to perform numerical, textual & statistical operations
brew "datamash"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose", link: false
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd", restart_service: true
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# DNS library written in C
brew "ldns"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# Run a Kubernetes cluster locally
brew "minikube"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@8"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Shell command parallelization utility
brew "parallel"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Emulator for x86 and PowerPC
brew "qemu"
# Tool for managing OCI containers and pods
brew "podman"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Rename multiple files in a directory
brew "ren"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Autoformat shell script source code
brew "shfmt"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "sketchybar", restart_service: true
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# A tiling window manager for macOS based on binary space partitioning.
brew "yabai", args: ["HEAD"], restart_service: true
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq", args: ["HEAD"]
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk", link: false
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# GPU-accelerated terminal emulator
cask "alacritty"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
