tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "teamookla/speedtest"
brew "antigen"
brew "python@3.10"
brew "ansible", link: false
brew "libssh2"
brew "aria2"
brew "bat"
brew "python@3.9"
brew "colordiff"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "docker"
brew "docker-compose", link: false
brew "fd"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "findutils"
brew "nghttp2"
brew "node"
brew "fx"
brew "fzf"
brew "gcc"
brew "gh"
brew "gifski"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "gradle"
brew "grep"
brew "htop"
brew "httpd"
brew "hyperkit"
brew "jq"
brew "librdkafka"
brew "kcat"
brew "ldns"
brew "librsync"
brew "minikube"
brew "moreutils"
brew "neovim"
brew "openblas"
brew "numpy"
brew "nvm"
brew "openjdk@8"
brew "openssh"
brew "openssl@3"
brew "tree"
brew "pass"
brew "qemu"
brew "podman"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "ssh-copy-id"
brew "tcl-tk"
brew "tmux"
brew "vim"
brew "wdiff"
brew "wget"
brew "yarn"
brew "yq"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mongodb/brew/mongocli"
brew "mongodb/brew/mongodb-community"
brew "qmk/qmk/qmk", link: false
brew "teamookla/speedtest/speedtest"
cask "hammerspoon"
cask "amethyst"
cask "basictex"
cask "font-fira-code"
cask "keycastr"
brew "fd"
brew "stow"
brew "nvm"
